memtier/performance/data/memorix/all-12.out
12        Threads
50        Connections per thread
100       Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.5 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets        18584.14          ---          ---         2.97075         2.83100         5.88700         7.23100        12.99100      1268.28 
Gets       185810.23        42.00    185768.23         2.93014         2.79900         5.82300         6.78300        12.28700      4699.95 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals     204394.37        42.00    185768.23         2.93383         2.79900         5.82300         6.84700        12.35100      5968.24 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.343        0.000
SET       2.607        5.000
SET       2.671       10.000
SET       2.703       15.000
SET       2.735       20.000
SET       2.751       25.000
SET       2.767       30.000
SET       2.783       35.000
SET       2.799       40.000
SET       2.815       45.000
SET       2.831       50.000
SET       2.831       52.500
SET       2.847       55.000
SET       2.847       57.500
SET       2.863       60.000
SET       2.879       62.500
SET       2.879       65.000
SET       2.895       67.500
SET       2.895       70.000
SET       2.911       72.500
SET       2.927       75.000
SET       2.927       76.250
SET       2.943       77.500
SET       2.943       78.750
SET       2.959       80.000
SET       2.959       81.250
SET       2.975       82.500
SET       2.991       83.750
SET       2.991       85.000
SET       3.007       86.250
SET       3.023       87.500
SET       3.039       88.125
SET       3.039       88.750
SET       3.055       89.375
SET       3.055       90.000
SET       3.071       90.625
SET       3.087       91.250
SET       3.103       91.875
SET       3.119       92.500
SET       3.135       93.125
SET       3.167       93.750
SET       3.183       94.062
SET       3.215       94.375
SET       3.247       94.688
SET       3.359       95.000
SET       3.759       95.312
SET       4.703       95.625
SET       5.119       95.938
SET       5.311       96.250
SET       5.407       96.562
SET       5.471       96.875
SET       5.503       97.031
SET       5.503       97.188
SET       5.535       97.344
SET       5.567       97.500
SET       5.567       97.656
SET       5.599       97.812
SET       5.631       97.969
SET       5.663       98.125
SET       5.663       98.281
SET       5.695       98.438
SET       5.727       98.516
SET       5.727       98.594
SET       5.759       98.672
SET       5.791       98.750
SET       5.823       98.828
SET       5.855       98.906
SET       5.887       98.984
SET       5.919       99.062
SET       5.983       99.141
SET       6.015       99.219
SET       6.047       99.258
SET       6.111       99.297
SET       6.143       99.336
SET       6.239       99.375
SET       6.463       99.414
SET       6.783       99.453
SET       7.167       99.492
SET       7.551       99.531
SET       8.031       99.570
SET       8.447       99.609
SET       8.639       99.629
SET       8.831       99.648
SET       9.087       99.668
SET       9.279       99.688
SET       9.471       99.707
SET       9.727       99.727
SET       9.919       99.746
SET      10.175       99.766
SET      10.431       99.785
SET      10.687       99.805
SET      10.815       99.814
SET      11.007       99.824
SET      11.135       99.834
SET      11.327       99.844
SET      11.519       99.854
SET      11.775       99.863
SET      12.031       99.873
SET      12.351       99.883
SET      12.607       99.893
SET      13.119       99.902
SET      13.375       99.907
SET      13.759       99.912
SET      14.335       99.917
SET      14.783       99.922
SET      15.231       99.927
SET      15.615       99.932
SET      15.935       99.937
SET      16.511       99.941
SET      17.023       99.946
SET      17.407       99.951
SET      17.663       99.954
SET      17.791       99.956
SET      18.047       99.958
SET      18.175       99.961
SET      18.431       99.963
SET      18.687       99.966
SET      18.687       99.968
SET      18.815       99.971
SET      18.815       99.973
SET      18.943       99.976
SET      18.943       99.977
SET      18.943       99.978
SET      18.943       99.979
SET      19.071       99.980
SET      19.071       99.982
SET      19.199       99.983
SET      19.583       99.984
SET      20.095       99.985
SET      20.607       99.987
SET      20.863       99.988
SET      21.119       99.988
SET      21.247       99.989
SET      21.375       99.990
SET      21.631       99.990
SET      21.759       99.991
SET      22.015       99.991
SET      22.143       99.992
SET      22.655       99.993
SET      22.783       99.993
SET      22.911       99.994
SET      22.911       99.994
SET      22.911       99.995
SET      23.039       99.995
SET      23.167       99.995
SET      23.295       99.995
SET      23.807       99.996
SET      23.935       99.996
SET      25.215       99.996
SET      25.599       99.997
SET      25.855       99.997
SET      26.111       99.997
SET      26.239       99.997
SET      26.367       99.997
SET      26.367       99.998
SET      26.495       99.998
SET      26.495       99.998
SET      26.751       99.998
SET      26.879       99.998
SET      27.007       99.998
SET      27.263       99.998
SET      27.391       99.999
SET      27.519       99.999
SET      27.519       99.999
SET      28.927       99.999
SET      28.927       99.999
SET      29.055       99.999
SET      29.055       99.999
SET      29.055       99.999
SET      29.567       99.999
SET      33.023       99.999
SET      33.535       99.999
SET      33.535       99.999
SET      33.535       99.999
SET      34.815       99.999
SET      34.815       99.999
SET      34.815       99.999
SET      34.815      100.000
SET      34.815      100.000
SET      34.815      100.000
[...]
SET      35.071      100.000
SET      35.071      100.000
SET      35.071      100.000
SET      36.863      100.000
SET      36.863      100.000
SET      37.375      100.000
SET      37.375      100.000
SET      37.375      100.000
[...]
SET      37.631      100.000
SET      37.631      100.000
SET      37.631      100.000
[...]
SET      37.887      100.000
SET      37.887      100.000
SET      37.887      100.000
[...]
SET      40.447      100.000
SET      40.447      100.000
---
GET       0.199        0.000
GET       2.575        5.000
GET       2.639       10.000
GET       2.671       15.000
GET       2.703       20.000
GET       2.719       25.000
GET       2.735       30.000
GET       2.751       35.000
GET       2.767       40.000
GET       2.783       45.000
GET       2.799       50.000
GET       2.799       52.500
GET       2.815       55.000
GET       2.815       57.500
GET       2.831       60.000
GET       2.831       62.500
GET       2.847       65.000
GET       2.863       67.500
GET       2.863       70.000
GET       2.879       72.500
GET       2.895       75.000
GET       2.895       76.250
GET       2.911       77.500
GET       2.911       78.750
GET       2.927       80.000
GET       2.927       81.250
GET       2.943       82.500
GET       2.943       83.750
GET       2.959       85.000
GET       2.975       86.250
GET       2.991       87.500
GET       2.991       88.125
GET       3.007       88.750
GET       3.007       89.375
GET       3.023       90.000
GET       3.023       90.625
GET       3.039       91.250
GET       3.055       91.875
GET       3.071       92.500
GET       3.087       93.125
GET       3.119       93.750
GET       3.135       94.062
GET       3.151       94.375
GET       3.183       94.688
GET       3.231       95.000
GET       3.423       95.312
GET       4.479       95.625
GET       5.023       95.938
GET       5.247       96.250
GET       5.343       96.562
GET       5.407       96.875
GET       5.439       97.031
GET       5.471       97.188
GET       5.503       97.344
GET       5.503       97.500
GET       5.535       97.656
GET       5.567       97.812
GET       5.567       97.969
GET       5.599       98.125
GET       5.631       98.281
GET       5.663       98.438
GET       5.663       98.516
GET       5.695       98.594
GET       5.727       98.672
GET       5.727       98.750
GET       5.759       98.828
GET       5.791       98.906
GET       5.823       98.984
GET       5.855       99.062
GET       5.887       99.141
GET       5.951       99.219
GET       5.983       99.258
GET       6.015       99.297
GET       6.047       99.336
GET       6.111       99.375
GET       6.175       99.414
GET       6.367       99.453
GET       6.719       99.492
GET       7.103       99.531
GET       7.519       99.570
GET       7.999       99.609
GET       8.255       99.629
GET       8.447       99.648
GET       8.703       99.668
GET       8.895       99.688
GET       9.151       99.707
GET       9.343       99.727
GET       9.599       99.746
GET       9.855       99.766
GET      10.111       99.785
GET      10.367       99.805
GET      10.495       99.814
GET      10.623       99.824
GET      10.751       99.834
GET      10.943       99.844
GET      11.071       99.854
GET      11.263       99.863
GET      11.519       99.873
GET      11.711       99.883
GET      12.031       99.893
GET      12.351       99.902
GET      12.607       99.907
GET      12.927       99.912
GET      13.311       99.917
GET      13.887       99.922
GET      14.463       99.927
GET      15.039       99.932
GET      15.487       99.937
GET      15.935       99.941
GET      16.639       99.946
GET      17.279       99.951
GET      17.535       99.954
GET      17.791       99.956
GET      18.047       99.958
GET      18.303       99.961
GET      18.687       99.963
GET      18.687       99.966
GET      18.815       99.968
GET      18.815       99.971
GET      18.815       99.973
GET      18.815       99.976
GET      18.815       99.977
GET      18.943       99.978
GET      18.943       99.979
GET      18.943       99.980
GET      19.071       99.982
GET      19.071       99.983
GET      19.199       99.984
GET      19.711       99.985
GET      20.095       99.987
GET      20.607       99.988
GET      20.863       99.988
GET      20.991       99.989
GET      21.247       99.990
GET      21.375       99.990
GET      21.631       99.991
GET      21.759       99.991
GET      22.015       99.992
GET      22.527       99.993
GET      22.783       99.993
GET      22.783       99.994
GET      22.783       99.994
GET      22.911       99.995
GET      22.911       99.995
GET      23.039       99.995
GET      23.039       99.995
GET      23.167       99.996
GET      23.423       99.996
GET      23.807       99.996
GET      24.319       99.997
GET      25.599       99.997
GET      25.727       99.997
GET      25.855       99.997
GET      26.111       99.997
GET      26.239       99.998
GET      26.367       99.998
GET      26.495       99.998
GET      26.623       99.998
GET      26.751       99.998
GET      26.879       99.998
GET      27.007       99.998
GET      27.007       99.999
GET      27.135       99.999
GET      27.263       99.999
GET      27.263       99.999
GET      27.391       99.999
GET      27.647       99.999
GET      28.799       99.999
GET      28.927       99.999
GET      28.927       99.999
GET      29.055       99.999
GET      29.311       99.999
GET      29.823       99.999
GET      30.335       99.999
GET      33.023       99.999
GET      33.023       99.999
GET      33.535       99.999
GET      33.535      100.000
GET      33.535      100.000
GET      34.815      100.000
GET      34.815      100.000
GET      34.815      100.000
[...]
GET      35.071      100.000
GET      35.839      100.000
GET      36.863      100.000
GET      36.863      100.000
GET      36.863      100.000
[...]
GET      37.119      100.000
GET      37.119      100.000
GET      37.375      100.000
GET      37.375      100.000
GET      37.375      100.000
[...]
GET      37.631      100.000
GET      37.631      100.000
GET      37.631      100.000
[...]
GET      39.935      100.000
GET      39.935      100.000
GET      39.935      100.000
[...]
GET      40.191      100.000
GET      40.191      100.000
GET      40.191      100.000
[...]
GET      42.239      100.000
GET      42.239      100.000
---
WAIT      0.000      100.000